{
  "under.development.message": "Under Development",

  "metadata.document.title": "Diogo Pereira | Front-end Developer",
  "metadata.og.title": "Diogo Pereira | Front-end Developer",
  "metadata.og.description": "Front-end Developer specialized in React.js, Next.js, Typescript, searching for new knowledge.",
  "metadata.page.description": "Front-end Developer specialized in React.js, Next.js, Typescript, searching for new knowledge.",

  "navbar.mobile.menu.workwithme.button": "Work with me",

  "header.title.description": "Front-end Developer",

  "aboutme.section.title": "About me",
  "aboutme.section.description.paragraph.1": "I've been studying programming since I was 14 years old. I started with creating Minecraft plugins, and worked on a server of Minecraft for a while.",
  "aboutme.section.description.paragraph.2": "However, I decided to switch to web development to further my career, and also due to the multitude of customization possibilities and ideas that can be incorporated into web pages.",
  "aboutme.section.description.paragraph.3": "During my transition, I had the opportunity to work on some small freelance projects, including anime websites and a few other more distinct ones.",
  
  "skills.section.title": "Skills",
  "skills.section.description": "Click on the technology to view all available information.",
  "skills.section.supporttechs.title": "Support Technologies:",
  "skills.section.basictechs.title": "Basic Knowledge:",

  "skills.section.skill.menu.experience.text": "Experience",
  "skills.section.skill.menu.description.text": "Description",
  "skills.section.skill.menu.experience.years.text": "years",
  "skills.section.skill.menu.experience.year.text": "year",
  "skills.section.skill.menu.experience.months.text": "months",
  "skills.section.skill.menu.experience.month.text": "month",

  "skills.section.skill.menu.description.reactjs": "I chose React.js as my main technology for studying because I like the diversity it brings. If I want to create a mobile application, I can use React Native, which is very similar to React.js in terms of structuring. Studying React.js allows me to have a broader range of knowledge at hand.",
  "skills.section.skill.menu.description.redux": "I have had a few interactions with Redux, but I had the opportunity to learn how to implement it and when to use it. Here's what I have learned:",
  "skills.section.skill.menu.description.nextjs": "Next.js is an almost essential tool for a React.js developer as it allows for much greater control over your application's performance and SEO. It enables server-side rendering (SSR), ensuring that your content appears for Google's indexing robots.",
  "skills.section.skill.menu.description.tailwind": "Tailwind is a very practical CSS framework in terms of productivity, even though it may sometimes seem messy. However, good component separation can easily solve that.",
  "skills.section.skill.menu.description.styledcomponents": "I used Styled-Components for a while before discovering Tailwind. It allows for better component separation since you can apply styles separately, unlike Tailwind. It is still an interesting choice, but I would use it in fewer projects.",
  "skills.section.skill.menu.description.mui": "Material-UI, like other pre-built component frameworks, provides the freedom of customization up to a certain point. It is a very useful tool when implemented alongside Tailwind or another styling framework. Material-UI is quite comprehensive, but it may not be sufficient for projects with many details.",
  "skills.section.skill.menu.description.typescript": "Typescript has become practically indispensable when working with JavaScript nowadays. It allows for much greater control over your code compared to plain JavaScript as it enables static typing. Additionally, the IntelliSense available in various code editors helps with identifying errors within the editor itself, which naturally aids debugging.",
  "skills.section.skill.menu.description.git": "Git is a tool that greatly facilitates teamwork and project version control. It is undeniably one of the essential tools for a programmer who values their career.",
  "skills.section.skill.menu.description.vscode": "VSCode is the most widely used tool among programmers, a code editor that is simple yet very feature-rich. It allows you to create extensions, and the community has developed many useful ones.",
  "skills.section.skill.menu.description.eslint": "ESLint is a tool for code standardization that greatly helps maintain a consistent syntax throughout a team project, preventing code syntax mess.",
  "skills.section.skill.menu.description.prettier": "Prettier is one of the most widely used code formatters among programmers. It is a simple code formatter that helps keep the code organized, similar to ESLint.",
  "skills.section.skill.menu.description.csharp": "I have used C# very little because I wanted to learn more about object-oriented programming.",
  "skills.section.skill.menu.description.cplus": "I have also used C++ very little because my goal in studying C++ was to better understand how pointers work, as it is a concept often encountered in various places, especially in college.",
  "skills.section.skill.menu.description.monogame": "Monogame is a framework for creating games using C# and .NET Framework. It allows you to create hard-coded games. I studied it a bit and even created a ping-pong game for school, but nothing too in-depth.",
  "skills.section.skill.menu.description.rust": "I studied Rust a bit when working on one of my projects that uses the Tauri framework for creating desktop apps with HTML/CSS/JS. I didn't delve too deep, but I know the basics of the syntax and Cargo.",
  "skills.section.skill.menu.description.tauri": "Tauri allows you to create desktop apps using the same technologies as the web. I used it only once for a project, and in the process, I learned a bit about Rust.",
  "skills.section.skill.menu.description.nodejs": "I usually use Node.js for private projects that require a backend. As a frontend developer, I don't focus too much on Node.js, but I can handle any application that requires the creation of an API or systems like authentication and posting.",
  "skills.section.skill.menu.description.express": "Express is the most widely used framework in Node.js nowadays. It allows you to create an HTTP server and manage routes dynamically, using middlewares, and more.",
  "skills.section.skill.menu.description.sql": "I have studied SQL a bit. I can perform basic queries such as select, delete(without using the where clause, just kidding), and all the basic CRUD operations.",
  "skills.section.skill.menu.description.sqlite": "SQLite is great for storing data locally. I have used it a few times for private projects that use Node.js.",
  "skills.section.skill.menu.description.mysql": "I have used MySQL very little. Regarding queries, it is very similar to other relational databases, so I can manage it if needed for something.",
  "skills.section.skill.menu.description.postgresql": "I have used PostgreSQL once for a personal Discord bot. It is quite versatile and easy to implement, so if needed, I know how to implement it.",

  "projects.section.title": "Projects",
  "projects.section.description": "Click on the project card to view all available information.",
  "projects.section.viewmore.button": "View more",
  "projects.section.project.mobile.menu.viewproject.button": "View project",

  "footer.developed.by.message": "Developed by"
}