{
  "under.development.message": "Under Development",

  "metadata.document.title": "Diogo Pereira | Front-end Developer",
  "metadata.og.title": "Diogo Pereira | Front-end Developer",
  "metadata.og.description": "Front-end Developer specialized in React.js, Next.js, Typescript, searching for new knowledge.",
  "metadata.page.description": "Front-end Developer specialized in React.js, Next.js, Typescript, searching for new knowledge.",

  "navbar.mobile.menu.workwithme.button": "Work with me",
  "navbar.aboutme.label": "About me",
  "navbar.skills.label": "Skills",
  "navbar.projects.label": "Projects",

  "header.title.span": "Hi, my name is",
  "header.title.description": "Front-end Developer",
  "header.description": "I have been specializing primarily in Front-End development to ensure excellent user experiences. I am always seeking new opportunities to apply my knowledge. I enjoy studying other areas in my spare time.",

  "aboutme.section.title": "About me",
  "aboutme.section.description.paragraph.1": "Since I was 14 years old, I have been involved in the world of programming. It all started when I began creating plugins for Minecraft, and I quickly found myself immersed in this fascinating universe. For a while, I also had the opportunity to work on a Minecraft server, which provided me with valuable experiences.",
  "aboutme.section.description.paragraph.2": "However, I felt the need to broaden my horizons and pursue a career in web development. I was drawn to the endless possibilities of customization and the freedom to bring innovative ideas to life through web pages.",
  "aboutme.section.description.paragraph.3": "During this transition, I had the opportunity to work on various freelance projects, covering a wide range of areas. From creating websites related to anime to more unique projects, each one challenged me and allowed me to explore my creativity to the fullest.",
  
  "experiences.section.title": "Experiences",

  "experiences.section.skill.menu.experience.text": "Experience",
  "experiences.section.skill.menu.experience.years.text": "years",
  "experiences.section.skill.menu.experience.year.text": "year",
  "experiences.section.skill.menu.experience.months.text": "months",
  "experiences.section.skill.menu.experience.month.text": "month",

  "experiences.section.skill.menu.description.reactjs": "I chose React.js as my main technology for studying because I like the diversity it brings. If I want to create a mobile application, I can use React Native, which is very similar to React.js in terms of structuring. Studying React.js allows me to have a broader range of knowledge at hand.",
  "experiences.section.skill.menu.description.redux": "I had a few interactions with Redux, and it is a great tool for managing global states. During my usage, I had the opportunity to learn how to implement it and when to use it.",
  "experiences.section.skill.menu.description.nextjs": "Next.js is an almost essential tool for a React.js developer as it allows for much greater control over your application's performance and SEO. It enables server-side rendering (SSR), ensuring that your content appears for Google's indexing robots.",
  "experiences.section.skill.menu.description.tailwind": "Tailwind is a very practical CSS framework in terms of productivity, even though it may sometimes seem messy. However, good component separation can easily solve that.",
  "experiences.section.skill.menu.description.styledcomponents": "I used Styled-Components for a while before discovering Tailwind. It allows for better component separation since you can apply styles separately, unlike Tailwind. It is still an interesting choice, but I would use it in fewer projects.",
  "experiences.section.skill.menu.description.mui": "Material-UI, like other pre-built component frameworks, provides the freedom of customization up to a certain point. It is a very useful tool when implemented alongside Tailwind or another styling framework. Material-UI is quite comprehensive, but it may not be sufficient for projects with many details.",
  "experiences.section.skill.menu.description.typescript": "Typescript has become practically indispensable when working with JavaScript nowadays. It allows for much greater control over your code compared to plain JavaScript as it enables static typing. Additionally, the IntelliSense available in various code editors helps with identifying errors within the editor itself, which naturally aids debugging.",
  "experiences.section.skill.menu.description.git": "Git is a tool that greatly facilitates teamwork and project version control. It is undeniably one of the essential tools for a programmer who values their career.",

  "projects.section.title": "Projects",
  "projects.section.description": "Click on the project card to view all available information.",
  "projects.section.viewmore.button": "View more",
  "projects.section.project.mobile.menu.viewproject.button": "View project",

  "footer.developed.by.message": "Developed by"
}