{
  "under-development-message": "Under Development",

  "metadata-document-title": "Diogo Pereira | Fullstack Developer",
  "metadata-og-title": "Diogo Pereira | Fullstack Developer",
  "metadata-og-description": "Fullstack Developer specializing in React.js, Next.js, Vue.js, Nuxt.js, Node.js, and TypeScript, always eager to learn more.",
  "metadata-page-description": "Fullstack Developer specializing in React.js, Next.js, Vue.js, Nuxt.js, Node.js, and TypeScript, always eager to learn more.",

  "navbar-mobile-menu-workwithme-button": "Contact Me",
  "navbar-aboutme-label": "About Me",
  "navbar-skills-label": "Skills",
  "navbar-projects-label": "Projects",

  "header-title-span": "Hi, my name is",
  "header-title-description": "Fullstack Developer",
  "header-description": "I have been specializing mainly in Fullstack development to ensure great user experiences and security in my projects. I am always looking for new opportunities to put my knowledge into practice. I enjoy studying other areas in my free time.",

  "aboutme-section-title": "About Me",
  "aboutme-section-description-paragraph-1": "Since I was 14 years old, I've been interested in programming. It all started when I began creating plugins for Minecraft, and soon I found myself immersed in this fascinating universe. For a while, I also had the opportunity to work on a Minecraft server, which provided me with valuable experiences.",
  "aboutme-section-description-paragraph-2": "However, I felt the need to broaden my horizons and pursue a career in web development. I was drawn to the countless customization possibilities and the freedom to bring innovative ideas to life through web pages.",
  "aboutme-section-description-paragraph-3": "During this transition, I had the opportunity to work on some freelance projects, which greatly helped me gain experience. The projects I participated in ranged from helping create websites related to anime to other more distinct projects. Each one of them challenged me and allowed me to develop my skills.",

  "experiences-section-title": "Experiences",

  "experiences-section-skill-menu-experience-text": "Experience",
  "experiences-skill-knowledges-message": "Knowledge",
  "experiences-section-skill-menu-experience-years-text": "years",
  "experiences-section-skill-menu-experience-year-text": "year",
  "experiences-section-skill-menu-experience-months-text": "months",
  "experiences-section-skill-menu-experience-month-text": "month",

  "experiences-section-skill-menu-description-reactjs": "I chose React.js as my primary study technology because I enjoy the diversity it offers. If I want to create a mobile application, I can use React Native, which is very similar to React.js in terms of structure. Therefore, studying React.js allows me to have a broader range of knowledge at hand.",
  "experiences-section-skill-menu-description-redux": "I have had limited interactions with Redux. It is an excellent tool for managing 'global' states. During my use, I had the opportunity to learn how to implement it and when to use it.",
  "experiences-section-skill-menu-description-nextjs": "Next.js is an almost essential tool for React.js developers because it allows much greater control over your application, both in terms of performance and SEO. It enables SSR, ensuring that your content is visible to Google's indexing bots.",
  "experiences-section-skill-menu-description-vuejs": "I chose to study Vue.js as one of my stacks because I liked its flexibility and the much lower learning curve compared to other frameworks/libs.",
  "experiences-section-skill-menu-description-nuxtjs": "Nuxt.js is an essential tool for Vue.js development because it facilitates server-side rendering, which ensures excellent SEO.",
  "experiences-section-skill-menu-description-nodejs": "Node.js is a widely used tool today for backend development. With it, you can create secure and scalable APIs while utilizing various other tools together to streamline development.",
  "experiences-section-skill-menu-description-tailwind": "Tailwind is a very practical CSS framework for productivity, even if it sometimes seems messy, but nothing that a good separation of components can't solve.",
  "experiences-section-skill-menu-description-typescript": "TypeScript has become almost indispensable today when working with JavaScript. It allows for infinitely greater control of your code compared to plain JavaScript, as it enables static typing. Additionally, the IntelliSense available in various code editors helps identify errors directly in the editor, which naturally aids debugging.",
  "experiences-section-skill-menu-description-git": "Git is a tool that greatly facilitates teamwork and project version control. It is undoubtedly one of the essential tools for a programmer who values their career.",

  "projects-section-title": "Projects",
  "projects-project-card-project-name-text": "Project Name",
  "projects-section-viewmore-button": "View More",
  "projects-section-project-mobile-menu-viewproject-button": "Access Project",

  "mysmallprojects-section-title": "Small Projects",

  "footer-developed-by-message": "Developed by"
}