{
  "metadata.document.title": "Diogo Pereira | Desenvolvedor Front-end",
  "metadata.og.title": "Diogo Pereira | Desenvolvedor Front-end",
  "metadata.og.description": "Desenvolvedor front-end especializado em React.js, Next.js e Typescript, sempre buscando novos conhecimentos.",
  "metadata.page.description": "Desenvolvedor front-end especializado em React.js, Next.js e Typescript, sempre buscando novos conhecimentos.",

  "navbar.mobile.menu.workwithme.button": "Contate-me",

  "header.title.description": "Desenvolvedor Front-end",

  "aboutme.section.title": "Sobre mim",
  "aboutme.section.description.paragraph.1": "Estudo programação desde os meus 14 anos. Eu comecei com a criação de plugins para o Minecraft, e trabalhei em um servidor de Minecraft por um tempo.",
  "aboutme.section.description.paragraph.2": "No entanto, decidi migrar para o desenvolvimento web para dar seguimento à minha carreira, e também devido a infinidade de possibilidades de personalização e às ideias que podem ser incorporadas em páginas da web.",
  "aboutme.section.description.paragraph.3": "Durante a minha migração eu tive a oportunidade de trabalhar em alguns projetos freelance pequenos, em sites de animes e alguns outros mais distintos.",

  "skills.section.title": "Habilidades",
  "skills.section.description": "Clique na tecnologia para visualizar todas as informações disponiveis.",
  "skills.section.supporttechs.title": "Tecnologias de suporte:",
  "skills.section.basictechs.title": "Conhecimento básico:",

  "skills.section.skill.menu.experience.text": "Experiência",
  "skills.section.skill.menu.description.text": "Descrição",
  "skills.section.skill.menu.experience.years.text": "anos",
  "skills.section.skill.menu.experience.year.text": "ano",
  "skills.section.skill.menu.experience.months.text": "meses",
  "skills.section.skill.menu.experience.month.text": "mes",

  "skills.section.skill.menu.description.reactjs": "Eu optei por escolher React.js para ter como tecnologia principal de estudos porque eu gosto da diversidade que ele traz, caso eu queira criar uma aplicação mobile eu posso utilizar o React Native que é muito parecido com o Reactjs em termos de estruturação então estudar React.js me permite ter uma diversidade maior de conhecimento em mãos.",
  "skills.section.skill.menu.description.redux": "Eu tive poucas interações com o Redux, mas eu tive a oportunidade de aprender a implementa-lo e quando usa-lo.",
  "skills.section.skill.menu.description.nextjs": "O Next.js é uma ferramenta quase que essencial para um desenvolvedor React.js, pois te permite ter um controle muito maior da sua aplicação, tanto em performance como em SEO, pois ele permite o SSR, que garante que seu conteúdo apareça para os robos de indexação do google.",
  "skills.section.skill.menu.description.tailwind": "O Tailwind é um framework CSS muito prático em questão de produtividade, mesmo que as vezes possa parecer uma bagunça, mas nada que uma boa separação de componentes não resolva.",
  "skills.section.skill.menu.description.styledcomponents": "Utilizei Styled-Components por um bom tempo antes de conhecer o Tailwind, ele te permite separar mais os componentes já você pode aplicar os estilos separadamente diferente do Tailwind, ele ainda é uma escolha interessante mas usaria em poucos projetos.",
  "skills.section.skill.menu.description.mui": "O Material-UI assim como outros frameworks de componentes pré-prontos te dá a liberdade de customização só até um certo ponto, mas é uma ferramenta muito útil se implementada junto de um Tailwind ou algum outro framework de estilos, o Material-UI é bem completo mas para projetos com muitos detalhes não tem como utilizar apenas ele.",
  "skills.section.skill.menu.description.typescript": "O Typescript se tornou praticamente indispensável hoje em dia quando se trata de trabalhar com Javascript, ele permite ter um controle infinitamente maior do seu código em comparação ao Javascript puro, já que te permite a utilização de tipagem estática, além do intellisense que está disponivel em diversos editores de código, o intellisense te permite identificar erros dentro do próprio editor, o que naturalmente ajuda muito o debug.",
  "skills.section.skill.menu.description.git": "O Git é uma ferramenta que facilita muito o trabalho em equipe e o controle de versionamento de projetos, é inegável que é uma das ferramentas obrigatórias para um programador que preze sua carreira.",
  "skills.section.skill.menu.description.vscode": "O VSCode é a ferramenta mais utilizada pelos programadores, um editor de códigos que é simples mas ao mesmo tempo muito completo, já que te permite criar extensões e a comunidade criou muitas extensões de utilidade.",
  "skills.section.skill.menu.description.eslint": "Eslint é uma ferramenta para padronizar seu código, ajuda muito em projetos em equipe para que mantenha um padrão até o fim para evitar bagunças de syntax no código.",
  "skills.section.skill.menu.description.prettier": "Um dos formatadores de códigos mais usado pelos programadores, é um simples code formatter que ajuda a manter o código organizado assim como o eslint.",
  "skills.section.skill.menu.description.csharp": "Utilizei muito pouco o C#, pois busquei estudar essa linguagem porque queria aprender um pouco mais sobre POO.",
  "skills.section.skill.menu.description.cplus": "C++ Assim como o C# eu utilizei muito pouco, pois o meu objetivo em estudar C++ era entender melhor como funciona ponteiros, pois é um conteúdo que se vê em diversos lugares principalmente na faculdade então apenas me adiantei.",
  "skills.section.skill.menu.description.monogame": "É um framework para a criação de jogos utilizando C# e .NET Framework, ele te permite criar jogos hard-coded, estudei um pouco sobre ele a ponto de criar um jogo de ping-pong para a escola, mas nada muito aprofundado.",
  "skills.section.skill.menu.description.rust": "Eu estudei um pouco sobre Rust quando estava criando um dos meus projetos que utiliza o framework Tauri para a criação de apps desktop com HTML/CSS/JS, não cheguei a me aprofundar muito, sei apenas o básico sobre a syntax e o Cargo.",
  "skills.section.skill.menu.description.tauri": "O Tauri te permite criar apps desktop com as mesmas tecnologias da Web, utilizei ele apenas uma vez para a criação de um projeto, e no processo consegui aprender um pouco sobre Rust.",
  "skills.section.skill.menu.description.nodejs": "Costumo utilizar ele para projetos pessoais não públicos e que precise de um Back-end, como sou Front-end não dou um foco tão grande ao Node.js mas consigo desenrolar qualquer aplicação que necessite da criação de uma API ou sistemas de, autenticação, postagens e etc.",
  "skills.section.skill.menu.description.express": "O Express é o framework mais utilizado hoje em dia no Node.js que te permite criar um servidor HTTP e gerenciar suas rotas de forma dinamica, utilizando middlewares e etc.",
  "skills.section.skill.menu.description.sql": "Estudei um pouco sobre SQL, sei realizar queries básicas como, select, delete sem utilizar o where(brincadeira), e etc, todas as operações básicas de um CRUD.",
  "skills.section.skill.menu.description.sqlite": "O SQLite é muito bom para salvar dados localmente, utilizei ele algumas vezes para a criação de projetos pessoais não públicos que utilizam Node.js.",
  "skills.section.skill.menu.description.mysql": "Utilizei ele muito pouco, em relação à queries é muito igual a outros bancos de dados relacionais obviamente, então eu sei desenrolar caso precise utilizar para alguma coisa.",
  "skills.section.skill.menu.description.postgresql": "Utilizei ele uma vez para um bot do discord pessoal, ele é bem versátil e fácil de implementar, então caso precise utilizar eu sei implementa-lo.",

  "projects.section.title": "Projetos",
  "projects.section.description": "Clique no cartão do projeto para visualizar todas as informações disponiveis.",
  "projects.section.viewmore.button": "Ver mais",
  "projects.section.project.mobile.menu.viewproject.button": "Acessar projeto",

  "footer.developed.by.message": "Desenvolvido por"
}